In [1]:
# Importing all the neccessary libraries
import pandas as pd # To load files and perform tasks
import numpy as np # linear algebra
import seaborn as sns  # data visualizations
import matplotlib.pyplot as plt # data visualizations

In [ ]:
#import plotly  #  interactive plotting library

In [2]:
df_cn= pd.read_csv("datasets/country_names_2_digit_codes.csv")
df_ce= pd.read_csv("datasets/currency_exchange.csv")
df_cex= pd.read_csv("datasets/glassdoor_benefits_comments.csv")
df_cnh= pd.read_csv("datasets/glassdoor_benefits_highlights.csv")
df_cnc= pd.read_csv("datasets/glassdoor_breadCrumbs.csv")
df_goc= pd.read_csv("datasets/glassdoor_overview_competitors.csv")
df_f= pd.read_csv("datasets/glassdoor_photos.csv")
df_grv= pd.read_csv("datasets/glassdoor_reviews_val_reviewResponses.csv")
df_gr= pd.read_csv("datasets/glassdoor_reviews.csv")
df_gss= pd.read_csv("datasets/glassdoor_salary_salaries.csv")
df_gwv= pd.read_csv("datasets/glassdoor_wwfu_val_captions.csv")
df_gwvp= pd.read_csv("datasets/glassdoor_wwfu_val_photos.csv")
df_gwvv= pd.read_csv("datasets/glassdoor_wwfu_val_videos.csv")
df_gww= pd.read_csv("datasets/glassdoor_wwfu.csv")
df_g= pd.read_csv("datasets/glassdoor.csv")

In [3]:
df_cn

                  Name Code
0          Afghanistan   AF
1       Ã…land Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [3]:
df_cn.head(1)

          Name Code
0  Afghanistan   AF

In [4]:
df_ce.head(1)

  Code                     Country    Currency  Number  ExchangeRate
0  AED  United Arab Emirates (The)  UAE Dirham   784.0      3.672779

In [5]:
df_cex.head(1)

,id,index,benefits.comments.val.city,benefits.comments.val.comment,benefits.comments.val.createDate,benefits.comments.val.currentJob,benefits.comments.val.jobTitle,benefits.comments.val.rating,benefits.comments.val.state
0,401,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df_cnh.head(1)

,id,benefits.highlights.val.highlightPhrase,benefits.highlights.val.icon,benefits.highlights.val.name,index,benefits.highlights.val.commentCount
0,44001,good flexibility for working from home,wfh,Work From Home,0.0,17.0

In [7]:
df_cnc.head(1)

      id  index breadCrumbs.val.name breadCrumbs.val.url
0  40801      0                 JOBS      /Job/index.htm

In [8]:
df_goc.head(1)

      id  index overview.competitors.val
0  12526      0                    Apple

In [9]:
df_f.head(1)

,id,index,photos.val.caption,photos.val.photoId,photos.val.photoId2x,photos.val.photoLink,photos.val.photoUrl,photos.val.photoUrl2x
0,26411,0,Mango day,10772510,10772511,/Photos/Afiniti-Office-Photos-IMG1912051.htm,https://media.glassdoor.com/lst/1436090/afinit...,https://media.glassdoor.com/lst2x/1436090/afin...

In [10]:
df_grv.head(1)

,id,index,reviews.val.reviewResponses.val.createDate,reviews.val.reviewResponses.val.helpfulCount,reviews.val.reviewResponses.val.jobTitle,reviews.val.reviewResponses.val.notHelpfulCount,reviews.val.reviewResponses.val.responseText,reviews.val.reviewResponses.val.responseTextLength,reviews.val.reviewResponses.val.totalHelpfulCount,reviews.val.reviewResponses.val.updateDate
0,6762,0,2018-05-01T03:54:11,0,NaN,0,Thank you for your review.,26,0,2018-05-02T00:23:37

In [11]:
df_grv.head(1)

,id,index,reviews.val.reviewResponses.val.createDate,reviews.val.reviewResponses.val.helpfulCount,reviews.val.reviewResponses.val.jobTitle,reviews.val.reviewResponses.val.notHelpfulCount,reviews.val.reviewResponses.val.responseText,reviews.val.reviewResponses.val.responseTextLength,reviews.val.reviewResponses.val.totalHelpfulCount,reviews.val.reviewResponses.val.updateDate
0,6762,0,2018-05-01T03:54:11,0,NaN,0,Thank you for your review.,26,0,2018-05-02T00:23:37

In [12]:
df_gr.head(1)

,id,index,reviews.val.cons,reviews.val.date,reviews.val.featured,reviews.val.helpfulCount,reviews.val.id,reviews.val.pros,reviews.val.publishedOn,reviews.val.publisher,...,reviews.val.reviewerJobTitle,reviews.val.reviewerLocation,reviews.val.reviewerStatus,reviews.val.summaryPoints.ceoApproval,reviews.val.summaryPoints.outlook,reviews.val.summaryPoints.recommend,reviews.val.title,reviews.val.adviceToManagement,reviews.val.companyResponse,reviews.val.reviewResponses
0,44001,0.0,Still not big enough in market place,"Oct 20, 2010",False,0.0,689142.0,"Great brand , Good leadership , Clear business...","Oct 20, 2010",Director,...,Director,Tokyo (Japan),Former Employee,1.0,0.0,1.0,American Express Japan - Excellent place to work,None,NaN,NaN

In [13]:
df_gss.head(1)

,id,index,salary.salaries.val.basePayCount,salary.salaries.val.jobTitle,salary.salaries.val.payPeriod,salary.salaries.val.salaryPercentileMap.payPercentile10,salary.salaries.val.salaryPercentileMap.payPercentile90,salary.salaries.val.salaryPercentileMap.payPercentile50,salary.salaries.val.salaryType
0,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df_gwv.head(1)

     id  index  wwfu.val.captions.val
0  1407      0  Our interview process

In [15]:
df_gwvp.head(1)

     id  index                                wwfu.val.photos.val
0  2370      0  https://media.glassdoor.com/template/l/40772/f...

In [16]:
df_gwvv.head(1)

     id  index                                wwfu.val.videos.val
0  4327      0  <iframe width="560" height="315" src="https://...

In [17]:
df_gww.head(1)

,id,index,wwfu.val.body,wwfu.val.id,wwfu.val.title,wwfu.val.type,wwfu.val.videos,wwfu.val.photos,wwfu.val.captions
0,449,0,"<p><img class=""lazy"" style=""display: block; ma...",133403,About Us,CUSTOM,NaN,NaN,NaN

In [ ]:
df_g.head(1)

In [47]:
# Dividimos el DataFrame en cuatro DataFrames
df_gs = np.array_split(df_g, 8, axis=1)

In [48]:
# Asigna cada DataFrame a una variable
df_g1 = df_gs[0]
df_g2 = df_gs[1]
df_g3 = df_gs[2]
df_g4 = df_gs[3]
df_g5 = df_gs[4]
df_g6 = df_gs[5]
df_g7 = df_gs[6]
df_g8 = df_gs[7]

In [168]:
df_g8["wwfu"].unique()

array([nan, 310.0, 311.0, ..., 6613.0, 6614.0, 6615.0], dtype=object)

In [ ]:
salary.country.name
salary.country.population
salary.country.shortName
salary.currency.currencyCode
salary.salaries
wwfu

In [169]:
#df_g8

In [119]:
#df_g1
#df_g2
#df_g3
#df_g4
#df_g5
#df_g6
#df_g7
#df_g8

In [128]:
df_selec3["header.locationType"].unique()

array(['C', 'N', 'S', nan], dtype=object)

In [171]:
# Selecciono ciertas columnas 
#df_selec1 = df_g1[["benefits.numRatings", "gaTrackerData.empId", "gaTrackerData.empName","gaTrackerData.empSize", "gaTrackerData.industry","gaTrackerData.industryId", "gaTrackerData.jobTitle", "gaTrackerData.location","gaTrackerData.locationId"]]
#df_selec2 = df_g2[["gaTrackerData.sectorId", "header.advertiserType"]]
#df_selec3 = df_g3[["header.jobTitle","header.locId", "header.location", "header.rating","header.normalizedJobTitle"]]
#df_selec4 = df_g4[["header.payHigh","header.payLow", "header.payMed","header.payPeriod", "header.salaryHigh","job.description","job.jobTitleId"]]
#df_selec5 = df_g5[["map.country","map.employerName", "map.lat","map.lng", "map.location","overview.hq","overview.industry","overview.revenue","overview.sectorId","overview.size"]]
#df_selec6 = df_g6[["rating.ceo.name"]]
#df_selec7 = df_g7[["salary.country.continent.id","salary.country.countryFIPS", "salary.country.currency.currencyCode","salary.country.currency.displayName", "salary.country.currency.id","salary.country.currency.name","salary.country.currencyCode"]]
df_selec8 = df_g8[["salary.country.name","salary.country.population", "salary.country.shortName","salary.currency.currencyCode","salary.salaries","wwfu"]]

In [132]:
#df_selec4

In [112]:
#df_selec4.head()

In [172]:
#df_selec1.isnull().sum()
#df_selec2.isnull().sum()
#df_selec3.isnull().sum()
#df_selec4.isnull().sum()
#df_selec5.isnull().sum()
#df_selec6.isnull().sum()
#df_selec7.isnull().sum()
df_selec8.isnull().sum()

salary.country.name              88513
salary.country.population        88513
salary.country.shortName         88513
salary.currency.currencyCode     88513
salary.salaries                  18141
wwfu                            146549
dtype: int64

In [173]:
#df_selec1.duplicated().sum()
#df_selec2.duplicated().sum()
#df_selec3.duplicated().sum()
#df_selec4.duplicated().sum()
#df_selec5.duplicated().sum()
#df_selec6.duplicated().sum()
#df_selec7.duplicated().sum()
df_selec8.duplicated().sum()

18140

In [174]:
#df_selec1.info()
#df_selec2.info()
#df_selec3.info()
#df_selec4.info()
#df_selec5.info()
#df_selec6.info()
#df_selec7.info()
df_selec8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165290 entries, 0 to 165289
Data columns (total 6 columns):
 #   Column                        Non-Null Count   Dtype
---  ------                        --------------   -----
 0   salary.country.name           76777 non-null   object
 1   salary.country.population     76777 non-null   object
 2   salary.country.shortName      76777 non-null   object
 3   salary.currency.currencyCode  76777 non-null   object
 4   salary.salaries               147149 non-null  object
 5   wwfu                          18741 non-null   object
dtypes: object(6)
memory usage: 7.6+ MB